


Name: Aboudou Koffitse

Quelle der Implementation:

https://github.com/crashoverloaded/Facial_expressions_Recognition

=========================Result===================================
2021-01-24 11:44:10.542711: I tensorflow/core/common_runtime/gpu/gpu_device.cc:1267]      
2021-01-24 11:44:10.543454: I tensorflow/compiler/jit/xla_gpu_device.cc:99] Not creating XLA devices, tf_xla_enable_xla_devices not set
Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 48, 48, 32)        320       
_________________________________________________________________
activation (Activation)      (None, 48, 48, 32)        0         
_________________________________________________________________
batch_normalization (BatchNo (None, 48, 48, 32)        128       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 48, 48, 32)        9248      
_________________________________________________________________
activation_1 (Activation)    (None, 48, 48, 32)        0         
_________________________________________________________________
batch_normalization_1 (Batch (None, 48, 48, 32)        128       
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 24, 24, 32)        0         
_________________________________________________________________
dropout (Dropout)            (None, 24, 24, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 24, 24, 64)        18496     
_________________________________________________________________
activation_2 (Activation)    (None, 24, 24, 64)        0         
_________________________________________________________________
batch_normalization_2 (Batch (None, 24, 24, 64)        256       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 24, 24, 64)        36928     
_________________________________________________________________
activation_3 (Activation)    (None, 24, 24, 64)        0         
_________________________________________________________________
batch_normalization_3 (Batch (None, 24, 24, 64)        256       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 12, 12, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 12, 12, 64)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 12, 12, 128)       73856     
_________________________________________________________________
activation_4 (Activation)    (None, 12, 12, 128)       0         
_________________________________________________________________
batch_normalization_4 (Batch (None, 12, 12, 128)       512       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 12, 12, 128)       147584    
_________________________________________________________________
activation_5 (Activation)    (None, 12, 12, 128)       0         
_________________________________________________________________
batch_normalization_5 (Batch (None, 12, 12, 128)       512       
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 6, 6, 128)         0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 6, 6, 128)         0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 6, 6, 256)         295168    
_________________________________________________________________
activation_6 (Activation)    (None, 6, 6, 256)         0         
_________________________________________________________________
batch_normalization_6 (Batch (None, 6, 6, 256)         1024      
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 6, 6, 256)         590080    
_________________________________________________________________
activation_7 (Activation)    (None, 6, 6, 256)         0         
_________________________________________________________________
batch_normalization_7 (Batch (None, 6, 6, 256)         1024      
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 3, 256)         0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 3, 3, 256)         0         
_________________________________________________________________
flatten (Flatten)            (None, 2304)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                147520    
_________________________________________________________________
activation_8 (Activation)    (None, 64)                0         
_________________________________________________________________
batch_normalization_8 (Batch (None, 64)                256       
_________________________________________________________________
dropout_4 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                4160      
_________________________________________________________________
activation_9 (Activation)    (None, 64)                0         
_________________________________________________________________
batch_normalization_9 (Batch (None, 64)                256       
_________________________________________________________________
dropout_5 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 7)                 455       
_________________________________________________________________
activation_10 (Activation)   (None, 7)                 0         
=================================================================
Total params: 1,328,167
Trainable params: 1,325,991
Non-trainable params: 2,176
_________________________________________________________________
None

==================================================================


Installtion Library

python -m pip install tensorflow==1.7.0
pip install tensorflow-gpu
pip uninstall tensorflow
pip install tensorflow-gpu

pip install tensorflow==1.15      # CPU
pip install tensorflow-gpu==1.15  # GPU

https://docs.nvidia.com/deeplearning/tensorrt/release-notes/tensorrt-4.html

https://docs.nvidia.com/deeplearning/cudnn/archives/cudnn-800-preview/cudnn-developer-guide/index.html


============Set up===========

face_classifier = cv2.CascadeClassifier(r'C:\Programpythons\Facial-Expressions-Recognition-master\images')
classifier =load_model(r'C:\Programpythons\Facial-Expressions-Recognition-master\validation')



